app/views/trainings/_form.html.haml

  #exercises
    = f.collection_select(:exercise_id, Exercise.all, :id, :title) do |exercise|
---
SELECT "exercises".* FROM "exercises"