app/controllers/trainings_controller.rb

SELECT "trainings".* FROM "trainings"
---
  def index
    @trainings = Training.all